In [22]:
import pandas as pd

In [38]:
# Read Department data
df_dept = pd.read_excel('db_dept.xlsx')

In [39]:
df_dept.head()

   id      department
0   1     engineering
1   2  human resource
2   3       operation
3   4       marketing
4   5           sales

In [40]:
# Read Employee Data
df_employee = pd.read_excel('db_employee.xlsx')

In [41]:
df_employee.head()

      id first_name last_name  salary  department_id
0  10301      Keith    Morgan   27056              2
1  10302      Tyler     Booth   32199              3
2  10303   Clifford    Nguyen   32165              2
3  10304       Mary     Jones   49488              3
4  10305    Melissa    Lucero   27024              3

In [42]:
# Fetch the employee details with maximum salary

emp_max_salary = df_employee[df_employee['salary'] == df_employee.loc[:,'salary'].max()]

In [43]:
emp_max_salary

       id first_name last_name  salary  department_id
86  10387     Ashley      Todd   49926              6

In [46]:
# Fetch the employee details with minimum salary

emp_min_salary = df_employee[df_employee['salary'] == df_employee.loc[:,'salary'].min()]
emp_min_salary

       id first_name last_name  salary  department_id
27  10328       Gene   Shepard   10143              3

In [77]:
# Find the maximum salary in operation department with id 3
dept3_max_sal = df_employee[df_employee['department_id'] == 3].loc[:,'salary'].max()
dept3_max_sal

49488

In [78]:
dept3_emp = df_employee[df_employee['department_id']==3]

In [79]:
dept3_emp[dept3_emp['salary']==dept3_max_sal]

      id first_name last_name  salary  department_id
3  10304       Mary     Jones   49488              3